public class Main {
    public static void main(String[] args) {
        // Задача №1
        System.out.println("Задача №1:");
        byte clientOS = 0;
        if (clientOS == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        } else {
            System.out.println("Установите версию приложения для iOS по ссылке");
        }
        System.out.println();
    }
}